#ให้ทำโปรแกรมคำนวณหาสีที่ต้องไปใช้ทาด้านนอกของกล่องสีเหลี่ยมขนาดใหญ่ 1 กล่องของทุกด้านว่าต้องใช้สีกี่แกลอนโดยให้มีผู้ใช้ป้อนความกว้าง ความยาว 
#ความสูงของกล่อง (หน่วยเป็นเมตร) ทางแป้นพิมพ์
#กล่องขนาดกว้าง ?? เมตร ยาว ?? เมตร ใช้จำนวน?? แกลอน
#ให้แสดงผมโดยใช้ print ทั้ง5แบบ
#ทั้งนี้สี 1 แกลอนทาได้ 5 ตารางเมตร ทั้งนี้จำนวนแกลอนที่คำนวณได้หากเป็นเลขทศนิยมให้ปัดขึ้นเป็นเลขจำนวนเต็ม
#เช่น คำนวนได้ 15.239 แกลอน เวลาแสดงผลต้องแสดงเป็น 16 แกลอน เป็นต้น
import math
width = float(input('โปรดป้อนความกว้าง (หน่วยเป็นเมตร): '))
lenght = float(input('โปรดป้อนความยาว (หน่วยเป็นเมตร): '))
hight = float(input('โปรดป้อนความสูง (หน่วยเป็นเมตร : )'))
print('---------------------------------------------')
print(f'กล่องใบนี้มี ความกว้าง {width} ความยาว{lenght} ความสูง{hight} ใช้จำนวน{math.ceil((2*(width*hight +lenght*hight))/5)} แกลอน')   
print('กล่องใบนี้มี ความกว้าง',width ,'ความยาว',lenght,'ความสูง',hight,'ใช้จำนวน',math.ceil((2*(width*hight +lenght*hight))/5) ,'แกลอน')   
print('กล่องใบนี้มี ความกว้าง'+str(width)+'ความยาว'+str(lenght)+ 'ความสูง'+str(hight)+ 'ใช้จำนวน'+str(math.ceil(((2*(width*hight +lenght*hight))/5))) +'แกลอน')   
print('กล่องใบนี้มี ความกว้าง {} ความยาว{} ความสูง{} ใช้จำนวน{} แกลอน'.format(width,lenght,hight,math.ceil(((2*(width*hight +lenght*hight))/5))))
print('กล่องใบนี้มี ความกว้าง %s ความยาว %s ความสูง %s ใช้จำนวน %d แกลอน'%(width,lenght,hight,math.ceil(((2*(width*hight +lenght*hight))/5))) )   
